[A_Creature_t3_base H7Creature]
mName="树胡"
mLore="树胡被珊提瑞法师广泛使用，他们以树精为原型创造了它们，作为个人的法力来源。这些人工生命体被种植在地下，吸收魔法能量并储存在其核心中，但在需要时，它们可以利用这些能量来保护主人和自己免受危险。尽管它们中的大多数在珊提瑞帝国的毁灭和火焰战争期间消亡，但它们的种子发芽并孕育了新一批的树傀儡。后来，许多树胡在伊罗兰定居，在那里它们帮助独角兽净化精灵森林中的混沌腐化，而其他的要么停止了作为傀儡的功能，变成了普通的树木，要么在龙脉旁形成了树丛。"

[A_Creature_t3_lv2 H7Creature]
mName="树胡守望者"
mLore="当表面的龙脉开始枯竭时，即使是居住在龙脉隘口的树胡，也被迫寻找新的方式来为自己提供能量，因为它们的根无法触及仍然充满龙血的地下湖和河流。年轻的树傀儡通过从大自然中获取所有养分来维持自身，但随着时间的推移，它们需要魔法能量来发育和成长。为了解决这个问题，树胡与被称为地精的次级土元素部落签订了契约。作为保护它们的定居点免受野兽和不速之客侵害的交换，这些小工匠向傀儡提供了大量从山脉深处开采的龙血水晶。一些地精甚至在巡逻时陪伴它们的守护者，利用树胡的魔法能量召唤尖锐的冰碎片并将其投向附近的敌人。"

[Ability.A_duplication H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="防御冰刺"
mTooltip="当此生物在防御姿态下被近战攻击时，攻击者承受 %buff.buff.d %icon_water 点水属性伤害。"

[Ability.A_duplication_Buff H7BaseBuff]
mName="防御冰刺"
mTooltip="该生物对任何以近战攻击它的生物造成 %d %icon_water 点水属性伤害。"

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="冰晶碎片"
mTooltip="每场战斗一次，该生物对目标敌方生物造成伤害，并在其身上放置一个冰晶碎片，该碎片在 3 回合后爆炸，造成 %buff.buff.d %icon_water 点水属性伤害。"

[Ability.A_sharp_Buff H7BaseBuff]
mName="冰晶碎片"
mTooltip="%durnow 回合后冰爆，对该生物造成 %d %icon_water 点水属性伤害。"